{"class_name": "Sequential", "config": [{"class_name": "Dropout", "config": {"name": "dropout_1", "batch_input_shape": [null, 3000, 1], "noise_shape": null, "rate": 0.25, "seed": null, "trainable": true, "dtype": "float32"}}, {"class_name": "Conv1D", "config": {"name": "conv1d_1", "kernel_size": [5], "activation": "relu", "dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_constraint": null, "padding": "valid", "strides": [1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "filters": 32, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_1", "pool_size": [4], "strides": [4], "trainable": true, "padding": "valid"}}, {"class_name": "Conv1D", "config": {"name": "conv1d_2", "kernel_size": [5], "activation": "relu", "dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_constraint": null, "padding": "valid", "strides": [1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "filters": 32, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_2", "pool_size": [4], "strides": [4], "trainable": true, "padding": "valid"}}, {"class_name": "LSTM", "config": {"return_sequences": false, "unit_forget_bias": true, "activation": "tanh", "units": 128, "trainable": true, "kernel_constraint": null, "stateful": false, "unroll": false, "recurrent_dropout": 0.0, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "dropout": 0.0, "name": "lstm_1", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_regularizer": null, "implementation": 1, "bias_constraint": null, "return_state": false, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "units": 100, "activation": "softmax", "bias_constraint": null, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null}}], "keras_version": "2.1.6", "backend": "tensorflow"}