{"backend": "tensorflow", "config": [{"config": {"name": "dropout_1", "trainable": true, "batch_input_shape": [null, 3000, 1], "seed": null, "rate": 0.25, "noise_shape": null, "dtype": "float32"}, "class_name": "Dropout"}, {"config": {"name": "conv1d_1", "activation": "relu", "strides": [1], "filters": 32, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "kernel_size": [5], "dilation_rate": [1], "kernel_constraint": null, "padding": "valid", "bias_regularizer": null}, "class_name": "Conv1D"}, {"config": {"name": "max_pooling1d_1", "trainable": true, "strides": [4], "pool_size": [4], "padding": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"name": "conv1d_2", "activation": "relu", "strides": [1], "filters": 32, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "kernel_size": [5], "dilation_rate": [1], "kernel_constraint": null, "padding": "valid", "bias_regularizer": null}, "class_name": "Conv1D"}, {"config": {"name": "max_pooling1d_2", "trainable": true, "strides": [4], "pool_size": [4], "padding": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"activation": "tanh", "dropout": 0.0, "units": 128, "recurrent_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "return_state": false, "unroll": false, "kernel_constraint": null, "kernel_regularizer": null, "unit_forget_bias": true, "bias_constraint": null, "recurrent_constraint": null, "go_backwards": false, "implementation": 1, "name": "lstm_1", "stateful": false, "trainable": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_sequences": false, "recurrent_dropout": 0.0, "bias_regularizer": null, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}, {"config": {"name": "dense_1", "activation": "softmax", "trainable": true, "units": 100, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.1.6"}