{"config": [{"config": {"seed": null, "trainable": true, "batch_input_shape": [null, 3000, 1], "name": "dropout_1", "dtype": "float32", "noise_shape": null, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "filters": 32, "dilation_rate": [1], "strides": [1], "activation": "relu", "padding": "valid", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "name": "conv1d_1", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_size": [5]}, "class_name": "Conv1D"}, {"config": {"pool_size": [4], "padding": "valid", "trainable": true, "strides": [4], "name": "max_pooling1d_1"}, "class_name": "MaxPooling1D"}, {"config": {"kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "filters": 32, "dilation_rate": [1], "strides": [1], "activation": "relu", "padding": "valid", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "name": "conv1d_2", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_size": [5]}, "class_name": "Conv1D"}, {"config": {"pool_size": [4], "padding": "valid", "trainable": true, "strides": [4], "name": "max_pooling1d_2"}, "class_name": "MaxPooling1D"}, {"config": {"stateful": false, "trainable": true, "bias_constraint": null, "return_state": false, "name": "lstm_1", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "implementation": 1, "recurrent_regularizer": null, "kernel_regularizer": null, "return_sequences": false, "units": 128, "recurrent_activation": "hard_sigmoid", "use_bias": true, "recurrent_dropout": 0.0, "unroll": false, "activation": "tanh", "unit_forget_bias": true, "bias_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "dropout": 0.0, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "recurrent_constraint": null}, "class_name": "LSTM"}, {"config": {"trainable": true, "bias_constraint": null, "units": 100, "use_bias": true, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.6"}