{"config": [{"config": {"rate": 0.25, "trainable": true, "name": "dropout_1", "seed": null, "noise_shape": null, "batch_input_shape": [null, 3000, 1], "dtype": "float32"}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "dilation_rate": [1], "trainable": true, "name": "conv1d_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "activity_regularizer": null, "use_bias": true, "strides": [1], "filters": 32, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [5], "padding": "valid"}, "class_name": "Conv1D"}, {"config": {"pool_size": [4], "trainable": true, "name": "max_pooling1d_1", "strides": [4], "padding": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"kernel_regularizer": null, "dilation_rate": [1], "trainable": true, "name": "conv1d_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "activity_regularizer": null, "use_bias": true, "strides": [1], "filters": 32, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [5], "padding": "valid"}, "class_name": "Conv1D"}, {"config": {"pool_size": [4], "trainable": true, "name": "max_pooling1d_2", "strides": [4], "padding": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"kernel_constraint": null, "units": 128, "activation": "tanh", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "return_sequences": false, "stateful": false, "go_backwards": false, "unroll": false, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "use_bias": true, "trainable": true, "name": "lstm_1", "implementation": 1, "recurrent_regularizer": null, "dropout": 0.0, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "recurrent_dropout": 0.0, "return_state": false, "recurrent_constraint": null, "unit_forget_bias": true}, "class_name": "LSTM"}, {"config": {"kernel_regularizer": null, "use_bias": true, "trainable": true, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 100, "activation": "softmax", "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.6"}