{"class_name": "Sequential", "config": [{"class_name": "Dropout", "config": {"rate": 0.25, "batch_input_shape": [null, 3000, 1], "noise_shape": null, "dtype": "float32", "trainable": true, "name": "dropout_1", "seed": null}}, {"class_name": "Conv1D", "config": {"bias_regularizer": null, "activity_regularizer": null, "strides": [1], "filters": 32, "dilation_rate": [1], "trainable": true, "name": "conv1d_1", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "use_bias": true, "kernel_size": [5]}}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "trainable": true, "name": "max_pooling1d_1", "strides": [4], "pool_size": [4]}}, {"class_name": "Conv1D", "config": {"bias_regularizer": null, "activity_regularizer": null, "strides": [1], "filters": 32, "dilation_rate": [1], "trainable": true, "name": "conv1d_2", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "use_bias": true, "kernel_size": [5]}}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "trainable": true, "name": "max_pooling1d_2", "strides": [4], "pool_size": [4]}}, {"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "name": "lstm_1", "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "return_sequences": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "units": 128, "implementation": 1, "unroll": false, "bias_regularizer": null, "unit_forget_bias": true, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "return_state": false, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "activation": "tanh", "use_bias": true, "stateful": false}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "units": 100, "kernel_constraint": null}}], "backend": "tensorflow", "keras_version": "2.1.6"}